system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |

# Author1: Nithin Adidela, IIT Goa
# email: nithin.adiela.16003@iitgoa.ac.in
# Author2: Revanth Sharma Kollegala, IIT Goa
# email: revanth.sharma.16003@iitgoa.ac.in
# Author3: Y Sudhakar, IIT Goa
# email: sudhakar@iitgoa.ac.in
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver          GAMG;
      tolerance       1e-06;
      relTol          0.1;
      smoother        GaussSeidel;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }
    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
